---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTotalNumberOfRisers
source: html/116c820c-3b97-12a7-14ba-453ec47df76e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTotalNumberOfRisers Property

"Total Number of Risers": Total number of risers

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTotalNumberOfRisers { get; }
```